[Strings]
L_ONLYCSCRIPT_Message="仅可由 cscript.exe 执行。"
L_UNKOPNM_Message="未知的操作名称:"
L_OP_Message="操作 - "
L_NOFILE_Message="文件不存在:"
L_PARZERO_Message="参数的长度为零 #"
L_INVOPT_ErrorMessage="不允许给定操作使用的开关:"
L_UNKOPT_ErrorMessage="未知开关:"
L_BLANKOPT_ErrorMessage="缺少开关名"
L_UNKOPT_GenMessage="命令行的用法无效。请键入 "winrm -?" 以获得帮助。"
L_HELP_GenMessage="请键入 "winrm -?" 获取帮助。"
L_ScriptNameNotFound_ErrorMessage="命令行的使用无效；命令字符串中未找到 winrm.vbs。"
L_ImproperUseOfQuotes_ErrorMessage="引用的参数值必须以引号开头和结尾:"
L_BADMATCNT1_Message="意外的匹配项计数 - 期望一个匹配项:"
L_OPTNOTUNQ_Message="选项不唯一: "
L_URIMISSING_Message="缺少 URI"
L_ACTIONMISSING_Message="缺少操作"
L_URIZERO_Message="URI 的长度为 0"
L_URIZEROTOK_Message="URI 无效，令牌的长度为 0"
L_INVWMIURI1_Message="WMI 资源 URI 无效 - 找不到任何 "/" (至少应有 2 个)"
L_INVWMIURI2_Message="WMI 资源 URI 无效 - 仅找到一个 "/" (至少应有 2 个)"
L_NOLASTTOK_Message="无效 URI - 无法定位根节点名称的最后一个令牌"
L_HashSyntax_ErrorMessage="语法错误: 输入的格式必须为 {KEY="VALUE"[;KEY="VALUE"]}"
L_ARGNOVAL_Message="未提供参数的值:"
L_XMLERROR_Message="无法解析 XML:"
L_XSLERROR_Message="无法解析 XSL 文件。该文件无法访问或无效:"
L_MSXML6MISSING_Message="无法加载 MSXML6，-format 选项和使用 "@{...}" 的集需要此项"
L_FORMATLERROR_Message="-format 的无效选项:"
L_FORMATFAILED_Message="无法重新格式化消息。未格式化的原始消息:"
L_PUT_PARAM_NOMATCH_Message="参数名与资源中的所有属性都不匹配: "
L_PUT_PARAM_MULTIMATCH_Message="参数与资源中的多个属性匹配: "
L_PUT_PARAM_NOARRAY_Message="@{...} 中不允许出现多个匹配的参数名称: "
L_PUT_PARAM_NOTATTR_Message="参数与资源中的非文本属性匹配: "
L_PUT_PARAM_EMPTY_Message="参数集为空。"
L_OPTIONS_PARAMETER_EMPTY_Message="Options 参数不包括值或格式不正确。"
L_RESOURCELOCATOR_Message="无法创建 ResourceLocator 对象。"
L_PUT_PARAM_NOINPUT_Message=""@{...}" 或 "-file:" 命令行参数不提供输入。"
L_ERR_Message="错误: "
L_ERRNO_Message="错误编号:"
L_OpDoesntAcceptInput_ErrorMessage="已将输入提供给不接受输入的操作。"
L_QuickConfigNoChangesNeeded_Message="在此计算机上设置了 WinRM 以进行远程管理。"
L_QuickConfig_MissingUpdateXml_0_ErrorMessage="无法在分析结果中找到更新指令。"
L_QuickConfigUpdated_Message="WinRM 已经进行了更新，以用于远程管理。"
L_QuickConfigUpdateFailed_ErrorMessage="无法完成一个或多个更新步骤。"
L_QuickConfig_InvalidBool_0_ErrorMessage="无法确定是否启用了远程功能。"
L_QuickConfig_RemotingDisabledbyGP_00_ErrorMessage="由于组策略设置发生冲突，无法完成请求。"
L_QuickConfig_UpdatesNeeded_0_Message="WinRM 没有设置成为了管理此计算机而允许对其进行远程访问。"
L_QuickConfig_UpdatesNeeded_1_Message="必须进行以下更改:"
L_QuickConfig_Prompt_0_Message="执行这些更改吗[y/n]? "
L_QuickConfigNoServiceChangesNeeded_Message="在此计算机上设置了 WinRM 以接收请求。"
L_QuickConfigNoServiceChangesNeeded_Message2="已在此计算机上运行 WinRM 服务。"
L_QuickConfigUpdatedService_Message="WinRM 已更新为接收请求。"
L_QuickConfig_ServiceUpdatesNeeded_0_Message="在此计算机上，WinRM 未设置为接收请求。"
L_Help_Title_0_Message="Windows 远程管理命令行工具"
L_Help_Blank_0_Message=""
L_Help_SeeAlso_Title_Message="另请参阅:"
X_Help_SeeAlso_Aliases_Message="  winrm help aliases"
X_Help_SeeAlso_Config_Message="  winrm help config"
X_Help_SeeAlso_CertMapping_Message="  winrm help certmapping"
X_Help_SeeAlso_CustomRemoteShell_Message="  winrm help customremoteshell"
X_Help_SeeAlso_Input_Message="  winrm help input"
X_Help_SeeAlso_Filters_Message="  winrm help 筛选器"
X_Help_SeeAlso_Switches_Message="  winrm help switches"
X_Help_SeeAlso_Uris_Message="  winrm help uris"
X_Help_SeeAlso_Auth_Message="  winrm help auth"
X_Help_SeeAlso_Set_Message="  winrm set -?"
X_Help_SeeAlso_Create_Message="  winrm create -?"
X_Help_SeeAlso_Enumerate_Message="winrm enumerate -?"
X_Help_SeeAlso_Invoke_Message="  winrm invoke -?"
X_Help_SeeAlso_Remoting_Message="  winrm help remoting"
X_Help_SeeAlso_configSDDL_Message="  winrm configsddl -?"
L_HelpHelp_000_0_Message="Windows 远程管理(WinRM)是 WS-Management 协议的 Microsoft 实现， "
L_HelpHelp_001_0_Message="该协议为使用 Web 服务的本地计算机和远程计算机"
L_HelpHelp_001_1_Message="之间的通信提供了一种安全的方式。"
L_HelpHelp_002_0_Message=""
L_HelpHelp_003_0_Message="使用情况:"
L_HelpHelp_004_0_Message="  winrm OPERATION RESOURCE_URI [-SWITCH:VALUE [-SWITCH:VALUE] ...]"
L_HelpHelp_005_0_Message="        [@{KEY=VALUE[;KEY=VALUE]...}]"
L_HelpHelp_007_0_Message=""
L_HelpHelp_008_0_Message="有关特定操作的帮助:"
L_HelpHelp_009_0_Message="  winrm g[et] -?        检索管理信息。"
L_HelpHelp_010_0_Message="  winrm s[et] -?        修改管理信息。"
L_HelpHelp_011_0_Message="  winrm c[reate] -?     创建管理资源的新实例。"
L_HelpHelp_012_0_Message="  winrm d[elete] -?     删除管理资源的实例。"
L_HelpHelp_013_0_Message="  winrm e[numerate] -?  列出管理资源的所有实例。"
L_HelpHelp_014_0_Message="  winrm i[nvoke] -?     执行管理资源上的方法。"
L_HelpHelp_015_0_Message="  winrm id[entify] -?   确定 WS-Management 实现是否"
L_HelpHelp_015_1_Message="                        正在远程计算机上运行。"
L_HelpHelp_016_0_Message="  winrm quickconfig -?  对该计算机进行配置以接受其他计算机的"
L_HelpHelp_016_1_Message="                          WS-Management　的请求。"
L_HelpHelp_016_3_Message="  winrm configSDDL -?   修改 URI 的现有安全描述符。"
L_HelpHelp_016_4_Message="  winrm helpmsg -?      显示错误消息的错误代码。"
L_HelpHelp_017_0_Message=""
L_HelpHelp_018_0_Message="有关相关主题的帮助:"
L_HelpHelp_019_0_Message="  winrm help uris       创建资源 URI 的方式。"
L_HelpHelp_020_0_Message="  winrm help aliases    URI 的缩写。"
L_HelpHelp_021_0_Message="  winrm help config     配置 WinRM 客户端和服务设置。"
L_HelpHelp_021_2_Message="  winrm help certmapping 配置客户端证书访问。"
L_HelpHelp_022_0_Message="  winrm help remoting   访问远程计算机的方式。"
L_HelpHelp_023_0_Message="  winrm help auth       提供远程访问的凭据。"
L_HelpHelp_024_0_Message="  winrm help input      提供输入以进行创建、设置和调用。"
L_HelpHelp_025_0_Message="  winrm help switches   其他开关，例如格式化、选项等等。"
L_HelpHelp_026_0_Message="  winrm help proxy      提供代理信息。"
L_HelpGet_000_0_Message="winrm get RESOURCE_URI [-SWITCH:VALUE [-SWITCH:VALUE] ...]"
L_HelpGet_001_0_Message=""
L_HelpGet_002_0_Message="使用指定的选项和键值对检索"
L_HelpGet_003_0_Message=" RESOURCE_URI 的实例。"
L_HelpGet_004_0_Message=""
L_HelpGet_005_0_Message="示例: 用 XML 格式检索当前配置:"
X_HelpGet_006_0_Message="  winrm get winrm/config -format:pretty"
L_HelpGet_007_0_Message=""
L_HelpGet_008_0_Message="示例: 检索 Win32_Service 类的 spooler 实例:"
X_HelpGet_009_0_Message="  winrm get wmicimv2/Win32_Service?Name=spooler"
L_HelpGet_010_0_Message=""
L_HelpGet_014_0_Message="示例: 检索此计算机上的 certmapping 项:"
X_HelpGet_015_0_Message="  winrm get winrm/config/service/certmapping?Issuer=1212131238d84023982e381f20391a2935301923+Subject=*.example.com+URI=wmicimv2/*"
L_HelpGet_016_0_Message=""
L_HelpSet_001_0_Message="winrm set RESOURCE_URI [-SWITCH:VALUE [-SWITCH:VALUE] ...]"
L_HelpSet_002_0_Message="          [@{KEY="VALUE"[;KEY="VALUE"]}]"
L_HelpSet_003_0_Message="          [-file:VALUE]"
L_HelpSet_004_0_Message=""
L_HelpSet_005_0_Message="通过键值对使用指定的开关和已更改的值的输入，"
L_HelpSet_006_0_Message="或通过输入文件使用已更新的对象"
L_HelpSet_007_0_Message="修改 RESOURCE_URI 中的设置。"
L_HelpSet_008_0_Message=""
L_HelpSet_009_0_Message="示例: 修改 WinRM 的配置属性:"
X_HelpSet_010_0_Message="  winrm set winrm/config @{MaxEnvelopeSizekb="100"}"
L_HelpSet_011_0_Message=""
L_HelpSet_012_0_Message="示例: 禁用该计算机上的侦听程序:"
X_HelpSet_013_0_Message="  winrm set winrm/config/Listener?Address=*+Transport=HTTPS @{Enabled="false"}"
L_HelpSet_014_0_Message=""
L_HelpSet_018_0_Message="示例: 禁用此计算机上的 certmapping 项:"
X_HelpSet_019_0_Message="  Winrm set winrm/config/service/certmapping?Issuer=1212131238d84023982e381f20391a2935301923+Subject=*.example.com+URI=wmicimv2/* @{Enabled="false"}"
L_HelpSet_020_0_Message=""
L_HelpCreate_001_0_Message="winrm create RESOURCE_URI [-SWITCH:VALUE [-SWITCH:VALUE] ...]"
L_HelpCreate_002_0_Message="             [@{KEY="VALUE"[;KEY="VALUE"]}]"
L_HelpCreate_003_0_Message="             [-file:VALUE]"
L_HelpCreate_004_0_Message=""
L_HelpCreate_005_0_Message="使用指定的键值对或输入文件"
L_HelpCreate_006_0_Message="生成 RESOURCE_URI 的实例。"
L_HelpCreate_007_0_Message=""
L_HelpCreate_008_0_Message="示例: 创建 IPv6 地址上的 HTTP 侦听程序实例:"
X_HelpCreate_009_0_Message="  winrm create winrm/config/Listener?Address=IP:3ffe:8311:ffff:f2c1::5e61+Transport=HTTP"
L_HelpCreate_010_0_Message=""
L_HelpCreate_011_0_Message="示例: 创建所有 IP 上的 HTTPS 侦听程序实例:"
X_HelpCreate_012_0_Message="  winrm create winrm/config/Listener?Address=*+Transport=HTTPS @{Hostname="HOST";CertificateThumbprint="XXXXXXXXXX"}"
L_HelpCreate_013_0_Message="注意: XXXXXXXXXX 代表 40 位的十六进制字符串；请参阅 help config。"
L_HelpCreate_014_0_Message=""
L_HelpCreate_015_0_Message="示例: 从 xml 创建 windows shell 命令实例:"
X_HelpCreate_016_0_Message="  winrm create shell/cmd -file:shell.xml -remote:srv.corp.com"
L_HelpCreate_017_0_Message=""
L_HelpCreate_022_0_Message="示例: 创建 CertMapping 项:"
X_HelpCreate_023_0_Message="  winrm create winrm/config/service/certmapping?Issuer=1212131238d84023982e381f20391a2935301923+Subject=*.example.com+URI=wmicimv2/* @{UserName="USERNAME";Password="PASSWORD"} -remote:localhost"
L_HelpCreate_024_0_Message=""
L_HelpDelete_001_0_Message="winrm delete RESOURCE_URI [-SWITCH:VALUE [-SWITCH:VALUE] ...]"
L_HelpDelete_002_0_Message=""
L_HelpDelete_003_0_Message="删除 RESOURCE_URI 的实例。"
L_HelpDelete_004_0_Message=""
L_HelpDelete_005_0_Message="示例: 为给定 IP 地址删除该计算机上的 HTTP 侦听程序:"
X_HelpDelete_006_0_Message="  winrm delete winrm/config/Listener?Address=IP:192.168.2.1+Transport=HTTP"
L_HelpDelete_007_0_Message=""
L_HelpDelete_008_0_Message="示例: 删除 certmapping 项:"
X_HelpDelete_009_0_Message="  winrm delete winrm/config/service/certmapping?Issuer=1212131238d84023982e381f20391a2935301923+Subject=*.example.com+URI=wmicimv2/*"
L_HelpDelete_010_0_Message=""
L_HelpEnum_001_0_Message="winrm enumerate RESOURCE_URI [-ReturnType:Value] [-Shallow]"
L_HelpEnum_001_1_Message="         [-BasePropertiesOnly] [-SWITCH:VALUE [-SWITCH:VALUE] ...]"
L_HelpEnum_002_0_Message=""
L_HelpEnum_003_0_Message="列出 RESOURCE_URI 的实例。"
L_HelpEnum_004_0_Message="可对使用筛选器和方言返回的实例进行限制，"
L_HelpEnum_005_0_Message="如果资源支持它们的话。"
L_HelpEnum_006_0_Message=""
L_HelpEnum_006_1_Message="ReturnType"
L_HelpEnum_006_2_Message="----------"
L_HelpEnum_006_3_Message="returnType 是可选开关，确定返回数据的类型。"
L_HelpEnum_006_4_Message="可能的选项有 'Object'、'EPR' 和 'ObjectAndEPR'。默认值是 Object"
L_HelpEnum_006_5_Message="如果指定了 Object 或如果忽略了开关，那么仅会返回"
L_HelpEnum_006_6_Message="对象。"
L_HelpEnum_006_7_Message="如果指定了 EPR，则仅会返回对象的 EPR "
L_HelpEnum_006_8_Message="(终结点引用)。EPR 包含有关资源 URI 和"
L_HelpEnum_006_9_Message="实例选择器的信息。"
L_HelpEnum_006_10_Message="如果指定了 ObjectAndEPR，那么对象和相关的 EPR 都会"
L_HelpEnum_006_11_Message="被返回。"
L_HelpEnum_006_12_Message=""
L_HelpEnum_006_13_Message="Shallow"
L_HelpEnum_006_14_Message="-------"
L_HelpEnum_006_15_Message="仅枚举在资源 URI 中指定的基类的实例。"
L_HelpEnum_006_16_Message="如果未指定此标志，将返回在资源 URI 中指定的基类"
L_HelpEnum_006_17_Message="及其所有派生类的实例。"
L_HelpEnum_006_18_Message=""
L_HelpEnum_006_19_Message="BasePropertiesOnly"
L_HelpEnum_006_20_Message="------------------"
L_HelpEnum_006_21_Message="仅包含在资源 URI 中指定的部分基类的属性。"
L_HelpEnum_006_22_Message="如果指定 -Shallow，则此标志不起作用。"
L_HelpEnum_006_23_Message=""
L_HelpEnum_007_0_Message="示例: 列出该计算机上的所有 WinRM 侦听程序:"
X_HelpEnum_008_0_Message="  winrm enumerate winrm/config/Listener"
L_HelpEnum_009_0_Message=""
L_HelpEnum_010_0_Message="示例: 列出 Win32_Service 类的所有实例:"
X_HelpEnum_011_0_Message="  winrm enumerate wmicimv2/Win32_Service"
L_HelpEnum_012_0_Message=""
L_HelpEnum_016_0_Message="示例: 列出计算机上的所有 shell 实例:"
X_HelpEnum_017_0_Message="  winrm enum shell/cmd -remote:srv.corp.com"
L_HelpEnum_018_0_Message=""
L_HelpEnum_019_0_Message="示例: 列出当前用户可以访问的资源:"
X_HelpEnum_020_0_Message="  winrm enum winrm/config/resource"
L_HelpEnum_021_0_Message=""
L_HelpEnum_022_0_Message="示例: 列出所有 certmapping 设置:"
X_HelpEnum_023_0_Message="  winrm enum winrm/config/service/certmapping"
L_HelpEnum_024_0_Message=""
L_HelpInvoke_001_0_Message="winrm invoke ACTION RESOURCE_URI [-SWITCH:VALUE [-SWITCH:VALUE] ...]"
L_HelpInvoke_002_0_Message="             [@{KEY="VALUE"[;KEY="VALUE"]}]"
L_HelpInvoke_003_0_Message="             [-file:VALUE]"
L_HelpInvoke_004_0_Message=""
L_HelpInvoke_005_0_Message="使用键值对指定的参数对 RESOURCE_URI 指定的"
L_HelpInvoke_006_0_Message="目标对象执行 ACTION 所指定的方法。"
L_HelpInvoke_007_0_Message=""
L_HelpInvoke_008_0_Message="示例: 调用 Spooler 服务上的 StartService 方法:"
X_HelpInvoke_009_0_Message="  winrm invoke StartService wmicimv2/Win32_Service?Name=spooler"
L_HelpInvoke_010_0_Message=""
L_HelpInvoke_011_0_Message="示例: 使用 XML 文件调用 Spooler 服务上的 StopService 方法:"
X_HelpInvoke_012_0_Message="  winrm invoke StopService wmicimv2/Win32_Service?Name=spooler -file:input.xml"
L_HelpInvoke_013_0_Message="其中 input.xml:"
X_HelpInvoke_014_0_Message="<p:StopService_INPUT xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wmi/root/cimv2/Win32_Service"/>"
L_HelpInvoke_015_0_Message=""
L_HelpInvoke_016_0_Message="示例: 使用指定参数调用 Win32_Process 类的 Create 方法:"
X_HelpInvoke_017_0_Message="  winrm invoke Create wmicimv2/Win32_Process @{CommandLine="notepad.exe";CurrentDirectory="C:\"}"
L_HelpInvoke_018_0_Message=""
L_HelpInvoke_019_0_Message="示例: 还原默认 winrm 配置:"
L_HelpInvoke_019_1_Message="注意，这将不会还原默认 winrm 插件配置:"
X_HelpInvoke_020_0_Message="winrm invoke restore winrm/config @{}"
L_HelpInvoke_021_0_Message=""
L_HelpInvoke_022_0_Message="示例: 还原默认 winrm 插件配置:"
L_HelpInvoke_022_1_Message="注意，在该操作期间会注销所有外部插件:"
X_HelpInvoke_023_0_Message="winrm invoke restore winrm/config/plugin @{}"
X_HelpIdentify_001_0_Message="winrm identify  [-SWITCH:VALUE [-SWITCH:VALUE] ...]"
L_HelpIdentify_003_0_Message=""
L_HelpIdentify_004_0_Message="在远程计算机上发布一个操作以检查"
L_HelpIdentify_005_0_Message=" WS-Management 服务是否正在运行。该操作必须与“-remote”开关一起运行。"
L_HelpIdentify_006_0_Message="若要在远程计算机上运行该未经身份验证的操作，请使用"
L_HelpIdentify_007_0_Message="-auth:none"
L_HelpIdentify_008_0_Message=""
L_HelpIdentify_009_0_Message="示例: 识别 www.example.com 上的 WS-Management 是否正在运行:"
X_HelpIdentify_010_0_Message="  winrm identify -remote:www.example.com"
X_HelpHelpMessaage_001_0_Message="winrm helpmsg errorcode"
X_HelpHelpMessaage_002_0_Message=""
X_HelpHelpMessaage_003_0_Message="显示与该错误代码相对应的错误消息。"
X_HelpHelpMessaage_004_0_Message="示例:"
X_HelpHelpMessaage_006_0_Message="  winrm helpmsg 0x5"
L_HelpAlias_001_0_Message="别名允许使用缩写代替完整资源 URI。"
L_HelpAlias_002_0_Message="可用的别名以及它们代替的 URI 为:"
L_HelpAlias_003_0_Message=""
X_HelpAlias_004_0_Message="wmi      = http://schemas.microsoft.com/wbem/wsman/1/wmi"
X_HelpAlias_005_0_Message="wmicimv2 = http://schemas.microsoft.com/wbem/wsman/1/wmi/root/cimv2"
X_HelpAlias_006_0_Message="cimv2    = http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2"
X_HelpAlias_007_0_Message="winrm    = http://schemas.microsoft.com/wbem/wsman/1"
X_HelpAlias_008_0_Message="wsman    = http://schemas.microsoft.com/wbem/wsman/1"
X_HelpAlias_009_0_Message="shell    = http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
L_HelpAlias_010_0_Message=""
L_HelpAlias_011_0_Message="示例: 使用完整资源 URI:"
L_HelpAlias_013_0_Message=""
L_HelpAlias_014_0_Message="示例: 使用别名:"
X_HelpAlias_015_0_Message="  winrm get wmicimv2/Win32_Service?Name=WinRM"
L_HelpUris_001_0_Message="统一资源标识符(URI)指定要用于操作的"
L_HelpUris_002_0_Message="管理资源。"
L_HelpUris_003_0_Message=""
L_HelpUris_004_0_Message="选择器和值在 URI 之后用以下格式传递:"
X_HelpUris_005_0_Message="  RESOURCE_URI?NAME=VALUE[+NAME=VALUE]..."
L_HelpUris_006_0_Message=""
L_HelpUris_007_0_Message="WMI 中所有信息的 URI 均为以下格式:"
X_HelpUris_008_0_Message="  WMI path = \\root\NAMESPACE[\NAMESPACE]\CLASS"
X_HelpUris_009_0_Message="  URI      = http://schemas.microsoft.com/wbem/wsman/1/wmi/root/NAMESPACE[/NAMESPACE]/CLASS"
X_HelpUris_010_0_Message="  ALIAS    = wmi/root/NAMESPACE[/NAMESPACE]/CLASS"
L_HelpUris_011_0_Message=""
L_HelpUris_012_0_Message="示例: 使用单一选择器获取有关 WMI 的 WinRM 服务的信息"
X_HelpUris_013_0_Message="  WMI path = \\root\cimv2\Win32_Service"
X_HelpUris_013_1_Message="  URI      = http://schemas.microsoft.com/wbem/wsman/1/wmi/root/cimv2/Win32_Service?Name=WinRM"
X_HelpUris_014_0_Message="  ALIAS    = wmi/root/cimv2/Win32_Service?Name=WinRM"
L_HelpUris_015_0_Message=""
L_HelpUris_015_1_Message="使用 WQL 筛选器枚举 WMI 实例时，"
L_HelpUris_015_2_Message="CLASS 必须为 "*" (星号)并且不应指定任何选择器。"
L_HelpUris_015_3_Message="示例:"
X_HelpUris_015_4_Message="URI = http://schemas.microsoft.com/wbem/wsman/1/wmi/root/cimv2/*"
L_HelpUris_015_5_Message=""
L_HelpUris_015_6_Message="访问 WMI singleton 实例时，不应指定任何选择器。"
L_HelpUris_015_7_Message="示例:"
X_HelpUris_015_8_Message="URI = http://schemas.microsoft.com/wbem/wsman/1/wmi/root/cimv2/Win32_Service"
L_HelpUris_015_9_Message=""
L_HelpUris_016_0_Message="注意: RESOURCE_URI 的某些部份可能区分大小写。使用 create 或"
L_HelpUris_017_0_Message="invoke 时，资源 URI 的最后部份必须与期望的 XML 的顶级元素"
L_HelpUris_018_0_Message="的大小写匹配。"
L_HelpConfig_001_0_Message="使用 winrm 命令行或通过 GPO 管理 WinRM 的配置。"
L_HelpConfig_002_0_Message="配置同时包括客户端和服务的全局配置。"
L_HelpConfig_003_0_Message=""
L_HelpConfig_004_0_Message="WinRM 服务至少需要一个侦听程序以表示 IP 地址，"
L_HelpConfig_005_0_Message="以接受该地址上的 WS-Management 请求。"
L_HelpConfig_006_0_Message="例如，如果计算机具备多个网卡，则可将 WinRM 配置为仅接受"
L_HelpConfig_007_0_Message="这些网卡其中之一的请求。 "
L_HelpConfig_008_0_Message=""
L_HelpConfig_009_0_Message="全局配置"
X_HelpConfig_010_0_Message="  winrm get winrm/config"
X_HelpConfig_011_0_Message="  winrm get winrm/config/client"
X_HelpConfig_012_0_Message="  winrm get winrm/config/service"
X_HelpConfig_012_1_Message="  winrm enumerate winrm/config/resource"
X_HelpConfig_012_2_Message="  winrm enumerate winrm/config/listener"
X_HelpConfig_012_3_Message="  winrm enumerate winrm/config/plugin"
X_HelpConfig_012_4_Message="winrm enumerate winrm/config/service/certmapping"
L_HelpConfig_013_0_Message=""
L_HelpConfig_014_0_Message="网络侦听需要一个或多个侦听程序。  "
L_HelpConfig_015_0_Message="侦听程序由两个选择器识别: Address 和 Transport。"
L_HelpConfigAddress_001_0_Message="Address 必须是以下内容之一:"
L_HelpConfigAddress_002_0_Message="  *           - 侦听计算机上的所有 IP "
L_HelpConfigAddress_003_0_Message="  IP:1.2.3.4  - 仅侦听指定的 IP 地址"
L_HelpConfigAddress_004_0_Message="  MAC:...     - 仅侦听指定 MAC 的 IP 地址。"
L_HelpConfigAddress_005_0_Message=""
L_HelpConfigAddress_006_0_Message="注意: 所有侦听受制于 IPv4Filter 和 IPv6Filter (在    "
L_HelpConfigAddress_007_0_Message="config/service."
L_HelpConfigAddress_008_0_Message="注意: IP 可能为 IPv4 地址或 IPv6 地址。"
L_HelpConfigTransport_001_0_Message="传输必须为以下内容之一:"
L_HelpConfigTransport_002_0_Message="  HTTP - 侦听 HTTP (默认端口为 5985)上的请求"
L_HelpConfigTransport_003_0_Message="  HTTPS - 侦听 HTTPS (默认端口为 5986)上的请求"
L_HelpConfigTransport_004_0_Message=""
L_HelpConfigTransport_005_0_Message="注意: 默认情况下 HTTP 流量仅允许"
L_HelpConfigTransport_006_0_Message="用 Negotiate 或 Kerberos SSP 加密的消息。"
L_HelpConfigTransport_007_0_Message=""
L_HelpConfigTransport_008_0_Message=""
L_HelpConfigTransport_009_0_Message="配置 HTTPS 时，使用以下属性:"
L_HelpConfigTransport_010_0_Message="  Hostname - 该计算机的名称；必须与证书中的 CN 匹配。"
L_HelpConfigTransport_011_0_Message="  CertificateThumbprint - 适用于服务器身份验证的证书"
L_HelpConfigTransport_012_0_Message="    的十六进制指纹。"
L_HelpConfigTransport_013_0_Message="注意: 如果仅提供 Hostname，则 WinRM 将试图找到对应的"
L_HelpConfigTransport_014_0_Message="证书。"
L_HelpConfigExamples_001_0_Message="示例: 侦听计算机上所有 IP 的 HTTP 请求:"
X_HelpConfigExamples_002_0_Message="  winrm create winrm/config/listener?Address=*+Transport=HTTP"
L_HelpConfigExamples_003_0_Message=""
L_HelpConfigExamples_004_0_Message="示例: 禁用给定的侦听程序"
X_HelpConfigExamples_005_0_Message="  winrm set winrm/config/listener?Address=IP:1.2.3.4+Transport=HTTP @{Enabled="false"}"
L_HelpConfigExamples_006_0_Message=""
L_HelpConfigExamples_007_0_Message="示例: 启用客户端而非服务上的基本身份验证:"
X_HelpConfigExamples_008_0_Message="  winrm set winrm/config/client/auth @{Basic="true"}"
L_HelpConfigExamples_009_0_Message=""
L_HelpConfigExamples_010_0_Message="示例: 为所有工作组计算机启用 Negotiate。"
X_HelpConfigExamples_011_0_Message="  winrm set winrm/config/client @{TrustedHosts="<local>"}"
L_HelpConfigExamples_012_0_Message=""
L_HelpConfigExamples_013_0_Message="示例: 将 IPv4 和 IPv6 主机地址添加到 TrustedHosts。"
X_HelpConfigExamples_014_0_Message="winrm set winrm/config/client @{TrustedHosts="1.2.3.4,[1:2:3::8]"}"
L_HelpConfigExamples_015_0_Message=""
L_HelpConfigExamples_016_0_Message="  注意: TrustedHosts 列表中的计算机可能未经过身份验证"
L_HelpCertMapping_001_0_Message="使用客户端证书将远程访问映射到 WinRM 的证书"
L_HelpCertMapping_002_0_Message="存储在以下资源 URI 所标识的"
L_HelpCertMapping_003_0_Message="证书映射表中:"
L_HelpCertMapping_003_1_Message=""
L_HelpCertMapping_004_0_Message=" winrm/config/service/CertMapping"
L_HelpCertMapping_005_0_Message=""
L_HelpCertMapping_006_0_Message="此表中的每个项目都包含五个属性:"
L_HelpCertMapping_007_0_Message=" Issuer -  颁发者证书的指纹。"
L_HelpCertMapping_008_0_Message=" Subject - 客户端证书的使用者字段。"
L_HelpCertMapping_009_0_Message=" URI - 应用此映射的 URI 或 URI 前缀。"
L_HelpCertMapping_009_1_Message=" Username - 用于处理请求的本地用户名。"
L_HelpCertMapping_009_2_Message=" Password - 用于处理请求的本地密码。"
L_HelpCertMapping_009_3_Message=" Enabled - 如果为 true，在处理时使用该选项。"
L_HelpCertMapping_010_0_Message="  "
L_HelpCertMapping_011_0_Message="对于要应用的客户端证书，颁发者证书必须 "
L_HelpCertMapping_012_0_Message="可以在本地使用，并且与项目的颁发者属性中的指纹相匹配"
L_HelpCertMapping_012_1_Message=""
L_HelpCertMapping_012_2_Message="对于要应用的客户端证书，其 DNS 或主体名称"
L_HelpCertMapping_013_0_Message="(来自 SubjectAlternativeName 字段)必须与 Subject 属性相匹配。"
L_HelpCertMapping_014_0_Message="值可以以通配符 '*' 开始。"
L_HelpCertMapping_014_1_Message="URI 标识所示客户端证书"
L_HelpCertMapping_014_2_Message="应该映射的资源。"
L_HelpCertMapping_014_3_Message="值可以以通配符 "*" 结束。"
L_HelpCertMapping_014_4_Message=""
L_HelpCertMapping_015_0_Message="如果客户端证书与该项匹配并且已启用， "
L_HelpCertMapping_016_0_Message="在确保用户有权访问 URI 安全表定义的资源以后，"
L_HelpCertMapping_017_0_Message="使用给定用户名和密码在本地帐户下"
L_HelpCertMapping_018_0_Message="处理请求。"
L_HelpCertMapping_019_0_Message=""
L_HelpCertMapping_020_0_Message="创建新项目或更改现有项目的密码时， "
L_HelpCertMapping_021_0_Message="由于 WinRM 服务必须存储密码以供将来使用，因此必须"
L_HelpCertMapping_022_0_Message="使用 -r 开关。"
L_HelpCertMappingExamples_001_0_Message="示例: 查看当前 CertMapping 配置"
X_HelpCertMappingExamples_002_0_Message="  winrm enumerate winrm/config/service/CertMapping"
L_HelpCertMappingExamples_003_0_Message="示例: 创建 CertMapping 项:"
X_HelpCertMappingExamples_004_0_Message="  winrm create winrm/config/service/certmapping?Issuer=1212131238d84023982e381f20391a2935301923+Subject=*.example.com+URI=wmicimv2/* @{UserName="USERNAME";Password="PASSWORD"} -remote:localhost"
L_HelpCertMappingExamples_005_0_Message=""
L_HelpConfigsddl_000_1_Message="winrm configsddl RESOURCE_URI"
L_HelpConfigsddl_001_0_Message=""
L_HelpConfigsddl_002_0_Message="更改插件配置中的现有条目以"
L_HelpConfigsddl_002_1_Message="控制对 WinRM 资源的远程访问。"
L_HelpConfigsddl_003_0_Message="如果此插件不存在，该命令将失败。"
L_HelpConfigsddl_004_0_Message=""
L_HelpConfigsddl_005_0_Message="此命令会启动一个 GUI 用于编辑安全设置。"
L_HelpConfigsddl_005_1_Message=""
L_HelpConfigsddl_006_0_Message="RESOURCE_URI 始终被视为前缀。"
L_HelpConfigsddl_010_0_Message=""
L_HelpConfigsddl_011_0_Message="若要更改默认安全性(RootSDDL 设置)，请使用:"
X_HelpConfigsddl_012_0_Message="  winrm configsddl default"
X_HelpQuickConfig_001_0_Message="winrm quickconfig [-quiet] [-transport:VALUE] [-force]"
X_HelpQuickConfig_002_0_Message=""
L_HelpQuickConfig_003_0_Message="执行配置操作以使此计算机能够进行远程管理。"
L_HelpQuickConfig_004_0_Message="其中包括:"
L_HelpQuickConfig_005_0_Message="1. 启动 WinRM 服务"
L_HelpQuickConfig_006_0_Message="2. 将 WinRM 服务类型设置为自动启动"
L_HelpQuickConfig_007_0_Message="3. 创建侦听程序以接受任意 IP 地址上的请求"
L_HelpQuickConfig_008_0_Message="4. 为 WS-Management 通信启用防火墙例外(仅适用于 http)"
X_HelpQuickConfig_009_0_Message=""
X_HelpQuickConfig_010_0_Message="-q[uiet]"
X_HelpQuickConfig_010_1_Message="--------"
L_HelpQuickConfig_011_0_Message="如果存在，quickconfig 将不提示确认。"
X_HelpQuickConfig_012_0_Message="-transport:VALUE"
X_HelpQuickConfig_013_0_Message="----------------"
L_HelpQuickConfig_014_0_Message="为特定传输执行 quickconfig。"
L_HelpQuickConfig_015_0_Message="可能的选项有 http 和 https。默认为 http。"
X_HelpQuickConfig_016_0_Message="-force"
X_HelpQuickConfig_017_0_Message="--------"
L_HelpQuickConfig_018_0_Message="如果存在，quickconfig 将不提示确认并启用"
L_HelpQuickConfig_019_0_Message="防火墙例外，而不考虑当前的网络配置文件设置。"
L_HelpRemote_001_0_Message="winrm OPERATION -remote:VALUE [-unencrypted] [-usessl]"
L_HelpRemote_002_0_Message=""
L_HelpRemote_003_0_Message="-r[emote]:VALUE"
L_HelpRemote_004_0_Message="---------------"
L_HelpRemote_005_0_Message="指定远程终点/系统的标识符。"
L_HelpRemote_006_0_Message="可以是简单主机名或完整 URL。"
L_HelpRemote_007_0_Message=""
L_HelpRemote_008_0_Message="  [TRANSPORT://]HOST[:PORT][/PREFIX]"
L_HelpRemote_009_0_Message=""
L_HelpRemote_010_0_Message="传输: HTTP 或 HTTPS 之一；默认值为 HTTP。"
L_HelpRemote_011_0_Message="主机: 格式可以为 DNS 名称、NetBIOS 名称或 IP 地址。"
L_HelpRemote_012_0_Message="端口: 如果没有指定端口，则将应用下列默认规则:"
L_HelpRemote_013_0_Message="前缀: 默认值为 wsman。"
L_HelpRemote_014_0_Message=""
L_HelpRemote_015_0_Message="注意: IPv6 地址必须包括在括号中。"
L_HelpRemote_016_0_Message="注意: 使用 HTTPS 时，计算机名称必须与服务器的证书公用名称(CN)"
L_HelpRemote_017_0_Message="      相匹配，除非使用 -skipCNcheck。"
L_HelpRemote_018_0_Message="注意: 端口和前缀的默认值可以在本地配置中进行更改。"
L_HelpRemoteExample_001_0_Message="示例: 通过 http 连接到 srv.corp.com:"
X_HelpRemoteExample_002_0_Message="  winrm get uri -r:srv.corp.com"
L_HelpRemoteExample_003_0_Message=""
L_HelpRemoteExample_004_0_Message="示例: 通过 https 连接到本地计算机 machine1:"
X_HelpRemoteExample_005_0_Message="  winrm get uri -r:https://machine1"
L_HelpRemoteExample_006_0_Message=""
L_HelpRemoteExample_007_0_Message="示例: 通过 http 连接到 IPv6 计算机:"
X_HelpRemoteExample_008_0_Message="  winrm get uri -r:[1:2:3::8]"
L_HelpRemoteExample_009_0_Message=""
L_HelpRemoteExample_010_0_Message="示例: 通过非默认端口和 URL 上的 https 连接到 IPv6 计算机:"
X_HelpRemoteExample_011_0_Message="  winrm get uri -r:https://[1:2:3::8]:444/path"
L_HelpRemoteUnencrypted_001_0_Message="-un[encrypted]"
L_HelpRemoteUnencrypted_002_0_Message="--------------"
L_HelpRemoteUnencrypted_003_0_Message="指定通过 HTTP 执行远程操作时不使用任何加密。"
L_HelpRemoteUnencrypted_004_0_Message="默认情况下不允许未加密的流量，"
L_HelpRemoteUnencrypted_005_0_Message="并且必须在本地配置中启用这项。"
L_HelpRemoteConfig_001_0_Message="若要对该计算机进行远程管理，请参阅:"
L_HelpAuth_001_0_Message="winrm OPERATION -remote:VALUE "
L_HelpAuth_002_0_Message="  [-authentication:VALUE] "
L_HelpAuth_003_0_Message="  [-username:USERNAME] "
L_HelpAuth_004_0_Message="  [-password:PASSWORD]"
L_HelpAuth_004_1_Message="  [-certificate:THUMBPRINT]"
L_HelpAuth_005_0_Message=""
L_HelpAuth_006_0_Message="远程连接时，可指定要使用的凭据和身份验证机制。"
L_HelpAuth_007_0_Message="如果未指定任何凭据和身份验证机制，"
L_HelpAuth_008_0_Message="将使用当前的登录用户的凭据。"
L_HelpAuthAuth_001_0_Message="-a[uthentication]:VALUE"
L_HelpAuthAuth_002_0_Message="-----------------------"
L_HelpAuthAuth_003_0_Message="与远程计算机进行通信时指定所使用的身份验证机制。"
L_HelpAuthAuth_004_0_Message="可能的选项为 None、Basic、Digest、Negotiate、Kerberos 和 CredSSP。"
L_HelpAuthAuth_004_1_Message="可能的选项为无、基本、摘要、协商、Kerberos。"
L_HelpAuthAuth_005_0_Message="示例:"
X_HelpAuthAuth_006_0_Message="  -a:None"
X_HelpAuthAuth_007_0_Message="  -a:Basic"
X_HelpAuthAuth_008_0_Message="  -a:Digest"
X_HelpAuthAuth_009_0_Message="  -a:Negotiate"
X_HelpAuthAuth_010_0_Message="  -a:Kerberos"
X_HelpAuthAuth_010_1_Message="  -a:Certificate"
X_HelpAuthAuth_010_2_Message="  -a:CredSSP"
L_HelpAuthAuth_011_0_Message="注意: 若未指定身份验证机制，则使用 Kerberos；"
L_HelpAuthAuth_012_0_Message="      若以下条件之一为 true，则使用 Negotiate:"
L_HelpAuthAuth_013_0_Message="   -提供明确的凭据且目标主机是受信任的"
L_HelpAuthAuth_013_1_Message="   -目标主机为 "localhost"、"127.0.0.1" 或 "[::1]""
L_HelpAuthAuth_013_2_Message="   -客户端计算机位于工作组内且目标主机是受信任的"
L_HelpAuthAuth_014_0_Message="注意: 默认情况下并非启用所有的身份验证机制。允许的"
L_HelpAuthAuth_015_0_Message="      身份验证机制可以由本地配置 "
L_HelpAuthAuth_016_0_Message="      或组策略控制。"
L_HelpAuthAuth_017_0_Message="注意: 大多数操作都需要一个身份验证模式，而不是 None。"
L_HelpAuthAuth_018_0_Message="注意: 证书身份验证只能与 HTTPS 传输一起使用。"
L_HelpAuthAuth_019_0_Message="      若要为 WinRM 服务配置 HTTPS 侦听程序，请运行命令:"
L_HelpAuthAuth_020_0_Message="      "winrm quickconfig -transport:HTTPS""
L_HelpAuthUsername_001_0_Message="-u[sername]:USERNAME"
L_HelpAuthUsername_002_0_Message="--------------------"
L_HelpAuthUsername_003_0_Message="指定远程计算机上的用户名。不能在本地计算机上使用。"
L_HelpAuthUsername_004_0_Message="用户必须是远程计算机上本地管理员组的成员。"
L_HelpAuthUsername_005_0_Message="如果用户帐户是远程计算机上的本地帐户，"
L_HelpAuthUsername_006_0_Message="则语法的格式应为 -username:USERNAME"
L_HelpAuthUsername_007_0_Message="如果用户名是域帐户，则语法的格式应为"
L_HelpAuthUsername_008_0_Message="-username:域\用户名"
L_HelpAuthUsername_009_0_Message="如果使用 Basic 或 Digest，则用 -username 是必需的。"
L_HelpAuthUsername_010_0_Message="如果使用 Kerberos，"
L_HelpAuthUsername_011_0_Message="则不提供 -username 时，就使用当前登录的用户的凭据。"
L_HelpAuthUsername_011_1_Message="只有域凭据可以与 Kerberos 一起使用。"
L_HelpAuthUsername_012_0_Message="如果使用了 Negotiate，那么将需要 -username，除非"
L_HelpAuthUsername_013_0_Message="下列条件之一为真:"
L_HelpAuthUsername_014_0_Message="   -目标主机为 "localhost"、"127.0.0.1" 或 "[::1]""
L_HelpAuthUsername_015_0_Message="   -客户端计算机位于工作组内且目标主机是受信任的"
L_HelpAuthUsername_016_0_Message="如果使用 CredSSP，则需要用户名和密码。"
L_HelpAuthPassword_001_0_Message="-p[assword]:PASSWORD"
L_HelpAuthPassword_002_0_Message="--------------------"
L_HelpAuthPassword_003_0_Message="在命令行上指定密码以替代交互式提示。"
L_HelpAuthPassword_004_0_Message="仅当使用 -username:USERNAME 选项时才适用。"
L_HelpAuthCertificate_001_0_Message="-c[ertificate]:THUMBPRINT"
L_HelpAuthCertificate_002_0_Message="--------------------"
L_HelpAuthCertificate_003_0_Message="指定本地计算机存储或当前用户存储中"
L_HelpAuthCertificate_004_0_Message="必须存在的证书指纹。证书必须专门用于"
L_HelpAuthCertificate_005_0_Message="客户端身份验证。"
L_HelpAuthCertificate_006_0_Message="仅在使用 -a:Certificate 时才应用。"
L_HelpAuthCertificate_007_0_Message="THUMBPRINT 可以包含一些空格，在这种情况下，必须使用"
L_HelpAuthCertificate_008_0_Message="双引号。"
L_HelpAuthCertificate_009_0_Message="示例:"
L_HelpAuthCertificate_010_0_Message="-c:7b0cf48026409e38a2d6348761b1dd1271c4f86d"
L_HelpAuthCertificate_011_0_Message="-c:"7b 0c f4 80 26 40 9e 38 a2 d6 34 87 61 b1 dd 12 71 c4 f8 6d""
X_HelpProxy_001_0_Message="winrm OPERATION -remote:VALUE"
X_HelpProxy_002_0_Message="[-proxyaccess:VALUE]"
X_HelpProxy_002_1_Message="[-proxyauth:VALUE]"
X_HelpProxy_003_0_Message="[-proxyusername:USERNAME]"
X_HelpProxy_004_0_Message="[-proxypassword:PASSWORD]"
L_HelpProxy_005_0_Message=""
L_HelpProxy_006_0_Message="远程连接时，可以指定使用哪些代理访问类型、"
L_HelpProxy_007_0_Message=" 代理凭据和代理身份验证机制。"
X_HelpProxyAccess_001_0_Message="-p[roxy]ac[cess]:VALUE"
L_HelpProxyAccess_002_0_Message="-----------------------"
L_HelpProxyAccess_003_0_Message="指定在连接到远程计算机时，检索哪些代理设置。"
L_HelpProxyAccess_004_0_Message="可能的选项有 ie_settings、winhttp_settings、auto_detect、no_proxy。"
L_HelpProxyAccess_005_0_Message="示例:"
X_HelpProxyAccess_006_0_Message="-pac:ie_settings"
X_HelpProxyAccess_007_0_Message="-pac:winhttp_settings"
X_HelpProxyAccess_008_0_Message="-pac:auto_detect"
X_HelpProxyAccess_009_0_Message="-pac:no_proxy"
L_HelpProxyAccess_010_0_Message=""
L_HelpProxyAccess_011_0_Message="WSMan 客户端提供四个选项作为代理设置的配置:"
L_HelpProxyAccess_012_0_Message="   -使用通过 Internet Explorer 配置的设置(默认)"
L_HelpProxyAccess_013_0_Message="   -使用通过 WinHTTP 配置的设置"
L_HelpProxyAccess_014_0_Message="   -自动代理发现"
L_HelpProxyAccess_015_0_Message="   - 直接连接(不使用代理)"
L_HelpProxyAuth_001_0_Message="-p[roxy]a[uth]:VALUE"
L_HelpProxyAuth_002_0_Message="-----------------------"
L_HelpProxyAuth_003_0_Message="指定用于对代理进行身份验证的身份验证机制。"
L_HelpProxyAuth_004_0_Message="可能的选项有基本、摘要式、协商。"
L_HelpProxyAuth_005_0_Message="示例:"
X_HelpProxyAuth_007_0_Message="-pa:Basic"
X_HelpProxyAuth_008_0_Message="-pa:Digest"
X_HelpProxyAuth_009_0_Message="-pa:Negotiate"
L_HelpProxyAuth_010_0_Message="如果使用了 -proxyauth:VALUE，则必须使用 -proxyaccess:VALUE。"
L_HelpProxyUsername_001_0_Message="-p[roxy]u[sername]:USERNAME"
L_HelpProxyUsername_002_0_Message="--------------------"
L_HelpProxyUsername_003_0_Message="指定用于对代理进行身份验证的用户名。不能在本地计算机上使用。"
L_HelpProxyUsername_005_0_Message="如果用户帐户是远程计算机上的本地帐户，"
L_HelpProxyUsername_006_0_Message="语法格式应为 -proxyusername:USERNAME"
L_HelpProxyUsername_007_0_Message="如果用户名是域帐户，则语法的格式应为"
L_HelpProxyUsername_008_0_Message="-proxyusername:域\用户名"
L_HelpProxyUsername_009_0_Message="如果使用了 -proxyusername，则必须使用 -proxyauth:VALUE。"
L_HelpProxyPassword_001_0_Message="-p[roxy]p[assword]:PASSWORD"
L_HelpProxyPassword_002_0_Message="--------------------"
L_HelpProxyPassword_003_0_Message="在命令行上指定密码以替代交互式提示。"
L_HelpProxyPassword_004_0_Message="仅当使用 -proxyusername:USERNAME 选项时适用。"
L_HelpInput_001_0_Message="输入可以是在命令行上直接提供键/值对"
L_HelpInput_002_0_Message="或从文件中读取 XML。"
L_HelpInput_003_0_Message=""
L_HelpInput_004_0_Message="  winrm OPERATION -file:VALUE "
L_HelpInput_005_0_Message="  winrm OPERATION @{KEY="VALUE"[;KEY="VALUE"]}"
L_HelpInput_006_0_Message=""
L_HelpInput_007_0_Message="适用于设置、创建和调用操作。"
L_HelpInput_008_0_Message="使用 @{KEY=VALUE} 或者使用来自 XML 文件的输入，但不同时使用这两者。"
L_HelpInput_009_0_Message=""
L_HelpInput_010_0_Message="-file:VALUE"
L_HelpInput_011_0_Message="-----------"
L_HelpInput_012_0_Message="指定用作输入的文件的名称。"
L_HelpInput_013_0_Message="VALUE 可以是绝对路径、相对路径或不带路径的文件名。"
L_HelpInput_014_0_Message="包含空格的名称或路径必须用引号括起来。"
L_HelpInput_015_0_Message=""
L_HelpInput_016_0_Message="@{KEY="VALUE"[;KEY="VALUE"]}"
L_HelpInput_017_0_Message="----------------------------"
L_HelpInput_018_0_Message="关键字不唯一。"
L_HelpInput_019_0_Message="值必须在引号中。"
L_HelpInput_020_0_Message="$null 是一个特殊值。"
L_HelpInput_021_0_Message=""
L_HelpInput_022_0_Message="示例:"
X_HelpInput_023_0_Message="  @{key1="value1";key2="value2"}"
X_HelpInput_024_0_Message="  @{key1=$null;key2="value2"}"
L_HelpFilter_001_0_Message="筛选器允许选择所需资源的子集:"
X_HelpFilter_002_0_Message=""
X_HelpFilter_003_0_Message="winrm enumerate RESOURCE_URI -filter:EXPR [-dialect:URI] [-Associations]..."
X_HelpFilter_004_0_Message=""
L_HelpFilter_005_0_Message="-filter:EXPR"
X_HelpFilter_006_0_Message="------------"
L_HelpFilter_007_0_Message="用于枚举的筛选器表达式。"
X_HelpFilter_008_0_Message=""
L_HelpFilter_009_0_Message="-dialect:URI"
X_HelpFilter_010_0_Message="------------"
L_HelpFilter_011_0_Message="枚举时筛选器表达式的方言。"
L_HelpFilter_012_0_Message="可能是远程服务支持的任何方言。"
X_HelpFilter_013_0_Message=""
L_HelpFilter_014_0_Message="下列别名可以用于方言 URI:"
X_HelpFilter_015_0_Message="* WQL - http://schemas.microsoft.com/wbem/wsman/1/WQL"
X_HelpFilter_016_0_Message="* Selector - http://schemas.dmtf.org/wbem/wsman/1/wsman/SelectorFilter"
X_HelpFilter_016_1_Message="* Association - http://schemas.dmtf.org/wbem/wsman/1/cimbinding/AssociationFilter"
X_HelpFilter_017_0_Message=""
L_HelpFilter_018_0_Message="与枚举一起使用时，方言 URI 默认为 WQL。"
X_HelpFilter_019_0_Message=""
L_HelpFilter_019_1_Message="-Associations"
L_HelpFilter_019_2_Message="------------"
X_HelpFilter_019_3_Message="仅当 Dialect 参数存在时，此参数才具有关联，且其值指定为 Association。否则不应使用此参数。"
X_HelpFilter_019_4_Message="这说明检索关联实例而不是关联的实例。缺少此参数将暗示要检索关联的实例。"
X_HelpFilter_019_5_Message=""
L_HelpFilter_020_0_Message="示例: 找到正在运行的服务"
X_HelpFilter_021_0_Message="  winrm e wmicimv2/Win32_Service -dialect:selector -filter:{State="Running"}"
X_HelpFilter_022_0_Message=""
L_HelpFilter_023_0_Message="示例: 找到没有运行的自动启动服务"
X_HelpFilter_024_0_Message="  winrm e wmicimv2/* -filter:"select * from Win32_Service where State!='Running' and StartMode='Auto'""
L_HelpFilter_025_0_Message=""
L_HelpFilter_026_0_Message="示例: 查找 winrm 服务所依赖的服务"
X_HelpFilter_027_0_Message="  winrm e wmicimv2/* -dialect:Association -filter:{Object=Win32_Service?Name=WinRM;AssociationClassName=Win32_DependentService;ResultClassName=win32_service;ResultRole=antecedent;Role=dependent}"
L_HelpSwitchTimeout_001_0_Message="-timeout:MS"
L_HelpSwitchTimeout_002_0_Message="-----------"
L_HelpSwitchTimeout_003_0_Message="超时(毫秒)。限制相应操作的持续时间。"
L_HelpSwitchTimeout_004_0_Message="可以按以下格式配置默认超时:"
X_HelpSwitchTimeout_005_0_Message="  winrm set winrm/config @{MaxTimeoutms="XXXXXX"}"
L_HelpSwitchTimeout_006_0_Message="其中 XXXXXX 是表示毫秒的整数。"
X_HelpSwitchSkipCACheck_001_0_Message="-skipCAcheck"
L_HelpSwitchSkipCACheck_002_0_Message="------------"
L_HelpSwitchSkipCACheck_003_0_Message="指定证书颁发者不必是受信任的根授权机构。"
L_HelpSwitchSkipCACheck_004_0_Message="仅在使用 HTTPS 的远程操作中使用(参见 -remote 选项)。"
L_HelpSwitchSkipCACheck_005_0_Message="应仅对受信任的计算机使用此选项。"
X_HelpSwitchSkipCNCheck_001_0_Message="-skipCNcheck"
L_HelpSwitchSkipCNCheck_002_0_Message="------------"
L_HelpSwitchSkipCNCheck_003_0_Message="指定服务器的证书公用名(CN)不必与"
L_HelpSwitchSkipCNCheck_004_0_Message="服务器的主机名匹配。"
L_HelpSwitchSkipCNCheck_005_0_Message="仅在使用 HTTPS 的远程操作中使用(参见 -remote 选项)。"
L_HelpSwitchSkipCNCheck_006_0_Message="应仅对受信任的计算机使用此选项。"
X_HelpSwitchSkipRevCheck_001_0_Message="-skipRevocationcheck"
X_HelpSwitchSkipRevCheck_002_0_Message="-------------------"
L_HelpSwitchSkipRevCheck_003_0_Message="指定不检查服务器证书的吊销状态。"
L_HelpSwitchSkipRevCheck_004_0_Message="仅在使用 HTTPS 的远程操作中使用(参见 -remote 选项)。"
L_HelpSwitchSkipRevCheck_005_0_Message="应仅对受信任的计算机使用此选项。"
X_HelpSwitchDefaultCreds_001_0_Message="-defaultCreds"
X_HelpSwitchDefaultCreds_002_0_Message="-------------------"
L_HelpSwitchDefaultCreds_003_0_Message="指定当使用协商时允许隐式凭据。"
L_HelpSwitchDefaultCreds_004_0_Message="仅在使用 HTTPS 的远程操作中才允许(参见 - remote 选项)。"
L_HelpSwitchDialect_001_0_Message="-dialect:VALUE"
L_HelpSwitchDialect_002_0_Message="--------------"
L_HelpSwitchDialect_003_0_Message="用于枚举或片断的筛选器表达式的方言。"
L_HelpSwitchDialect_004_0_Message="示例: 使用 WQL 查询"
X_HelpSwitchDialect_005_0_Message="  -dialect:http://schemas.microsoft.com/wbem/wsman/1/WQL"
L_HelpSwitchDialect_006_0_Message="示例: 将 XPATH 用于使用枚举或碎片 get/set 进行的筛选。"
X_HelpSwitchDialect_007_0_Message="  -dialect:http://www.w3.org/TR/1999/REC-xpath-19991116"
L_HelpSwitchFragment_001_0_Message="-fragment:VALUE"
L_HelpSwitchFragment_002_0_Message="---------------"
L_HelpSwitchFragment_003_0_Message="指定位于实例 XML 中的部份，该实例 XML 将要为给定操作"
L_HelpSwitchFragment_004_0_Message="进行更新或检索。"
L_HelpSwitchFragment_005_0_Message="示例: 获取后台打印程序服务的状态"
X_HelpSwitchFragment_006_0_Message="  winrm get wmicimv2/Win32_Service?name=spooler -fragment:Status/text()"
L_HelpSwitchOption_001_0_Message="-options:{KEY="VALUE"[;KEY="VALUE"]}"
L_HelpSwitchOption_002_0_Message="------------------------------------"
L_HelpSwitchOption_003_0_Message="特定提供程序选项的键/值对。"
L_HelpSwitchOption_004_0_Message="若要将 NULL 指定为一个值，请使用 $null"
L_HelpSwitchOption_005_0_Message=""
L_HelpSwitchOption_006_0_Message="示例:"
X_HelpSwitchOption_007_0_Message="  -options:{key1="value1";key2="value2"}"
X_HelpSwitchOption_008_0_Message="  -options:{key1=$null;key2="value2"}"
X_HelpSwitchSPNPort_001_0_Message="-SPNPort"
L_HelpSwitchSPNPort_002_0_Message="--------"
L_HelpSwitchSPNPort_003_0_Message="将端口号附加到远程服务器的服务主体名称(SPN)上。"
L_HelpSwitchSPNPort_004_0_Message="使用 Negotiate 或 Kerberos 身份验证机制时"
L_HelpSwitchSPNPort_005_0_Message="会使用服务主体名称。"
L_HelpSwitchEncoding_001_0_Message="-encoding:VALUE"
L_HelpSwitchEncoding_002_0_Message="---------------"
L_HelpSwitchEncoding_003_0_Message="指定与远程计算机通讯时使用的编码类型(请参阅 -remote"
L_HelpSwitchEncoding_004_0_Message="选项)。可能的选项有 "utf-8" 和 "utf-16"。"
L_HelpSwitchEncoding_005_0_Message="默认值为 utf-8。"
L_HelpSwitchEncoding_006_0_Message="示例:"
X_HelpSwitchEncoding_007_0_Message="  -encoding:utf-8"
X_HelpSwitchEncoding_008_0_Message="  -encoding:utf-16"
L_HelpSwitchFormat_001_0_Message="-f[ormat]:FORMAT"
L_HelpSwitchFormat_002_0_Message="----------------"
L_HelpSwitchFormat_003_0_Message="指定输出的格式。"
L_HelpSwitchFormat_004_0_Message="FORMAT 可以是 "xml"、"pretty" (格式更好的 XML)或 "text"。"
L_HelpSwitchFormat_005_0_Message="示例:"
X_HelpSwitchFormat_006_0_Message="  -format:xml"
X_HelpSwitchFormat_007_0_Message="  -format:pretty"
X_HelpSwitchFormat_008_0_Message="  -format:text"
L_HelpRemoteUseSsl_001_0_Message="-[use]ssl"
L_HelpRemoteUseSsl_002_0_Message="---------"
L_HelpRemoteUseSsl_003_0_Message="指定在执行远程操作时将使用 SSL 连接。"
L_HelpRemoteUseSsl_004_0_Message="不应指定远程选项中的传输。"
L_HelpRemote_012_1_Message="        * 如果指定通过 HTTP 进行传输，则将使用端口 80。"
L_HelpRemote_012_2_Message="        * 如果指定通过 HTTPS 进行传输，则将使用端口 443。"
L_HelpRemote_012_3_Message="        * 如果没有指定传输，也没有指定 -usessl，"
L_HelpRemote_012_4_Message="          则将使用端口 5985 进行 HTTP 连接。"
L_HelpRemote_012_5_Message="        * 如果没有指定传输，而指定了 -usessl，"
L_HelpRemote_012_6_Message="          则将使用端口 5986 进行 HTTPS 连接。"
